tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
#define GPIOTE_IRQ_PRI                  APP_IRQ_PRIORITY_HIGH                       /**< Set priority of GPIOTE to application high */

#define ADC_IRQ_PRI                     APP_IRQ_PRIORITY_HIGH                       /**< Set priority of ADC to application high */

#define UART_IRQ_PRI                    APP_IRQ_PRIORITY_LOW                        /**< Set priority of UART to application low */

#define UART_FIFO_TX_SIZE               128                                         /**< UART TX FIFO size (must be power of 2) */
#define UART_FIFO_RX_SIZE               128                                         /**< UART RX FIFO size (must be power of 2) */

#define DCC_COMMAND_BUFFER_SIZE         52                                          /**< Size of DCC Command buffer, this is 32+20 for worst case service mode*/

#define ACTUATION_INTERVAL              1000                                        /**< Relay actuation interval (ms) (1s seems reasonable to guarantee actuation) */

#define ADC_SAMPLE_INTERVAL             0.5                                         /**< ADC sample interval (ms) (this allows at least 10 samples during a minimum 5ms feedback window, see S-9.2.3) */

#define FUNCTION_READ_BIT               1                                           /**< Enum for read_bit function */
#define FUNCTION_READ_BYTE              2                                           /**< Enum for read_byte function */
#define FUNCTION_WRITE_BIT              3                                           /**< Enum for write_bit function */
#define FUNCTION_WRITE_BYTE             4                                           /**< Enum for write_byte function */
#define MODE_DIRECT                     1                                           /**< Enum for direct mode */
#define MODE_PAGED                      2                                           /**< Enum for paged mode */
#define MODE_REGISTER                   3                                           /**< Enum for register mode */
#define MODE_ADDRESS                    4                                           /**< Enum for address mode */
#define READ_BYTE_COUNTER_MAX           255                                         /**< Maximum value for the read byte counter (maximum value of 8 bit unsigned integer) */
#define READ_BIT_COUNTER_MAX            7                                           /**< Maximum value for the read bit counter (8-1) */
#define READ_BIT_COUNTER_MAX_ADDRESS    127                                         /**< Maximum value for the read byte counter when in address mode (short address cannot be greater than 127) */

#define ADDRESS_TYPE_INVALID            0                                           /**< Enum for invalid address type */
#define ADDRESS_TYPE_BROADCAST          1                                           /**< Enum for broadcast address type */
#define ADDRESS_TYPE_SHORT_CONSIST      2                                           /**< Enum for short or consist address type */
#define ADDRESS_TYPE_LONG               3                                           /**< Enum for long address type */

#define COMMAND_REPEATS                 10                                          /**< Number of times to repeat a DCC command (arbitrary selection) */

#define SPEED_COMMAND_ARRAY_SIZE        128                                         /**< Number of addresses we can store a speed command for. This places a limitation on the number of trains we can concurrently support. */

#define MAIN                            0                                           /**< Indicates DCC commands are sent to the main track. */
#define PROGRAMMING                     1                                           /**< Indicates DCC commands are sent to the programming track. */
#define MAIN_REPEAT                     2                                           /**< Indicates repeating DCC commands are being sent to the main track in programming mode */

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device */

#define DEVICE_NAME                     "BlueTrack"                                 /**< Name of device. Will be included in the advertising data. Limit length to 11 to allow Master Emulator to connect (unexplained). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register (no prescaling, maximum resolution). */
#define APP_TIMER_MAX_TIMERS            3                                           /**< Maximum number of simultaneously created timers (only output timer and feedback timer). */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues (only output timer and feedback timer, + 1 for how the queue is implemented). */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(500, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(1000, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_TIMEOUT               30                                          /**< Timeout for Pairing Request or Security Request (in seconds). */
#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Timer is our largest scheduled event (8 bytes). Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. This is a best guess. */

/**@brief Structure of a DCC command. */
typedef struct
{
    bool occupied;
    bool sync;
    bool feedback;
    uint32_t data0;
    uint32_t data1;
    uint32_t data2;
    uint8_t data0_count;
    uint8_t data1_count;
    uint8_t data2_count;
} dcc_command_t;

/**@brief Structure of a scheduled DCC command. */
typedef struct
{
    uint8_t byte1;
    uint8_t byte2;
    uint8_t byte3;
    uint8_t byte4;
    uint8_t byte5;
    uint8_t len;
    uint8_t feedback;
} scheduled_dcc_command_t;

static ble_gap_sec_params_t             m_sec_params;                               /**< Security requirements for this application. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

