tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
// Persistent storage system event handler
void pstorage_sys_event_handler (uint32_t p_evt);

static ble_bluetrack_t                  m_bluetrack;                                          /**< BlueTrack service structure instance */
static app_timer_id_t                   output_timer;                                         /**< App Timer instance for relay output timing */
static app_timer_id_t                   feedback_timer;                                       /**< App Timer instance for feedback ADC measurement timing */
static uint32_t                         output_index[N_OUTPUTS];                              /**< Pin Number storage for the relay outputs */
static bool                             output_flags[N_OUTPUTS];                              /**< Flags for requesting relay activation */
static dcc_command_t                    dcc_command_buffer[DCC_COMMAND_BUFFER_SIZE];          /**< DCC command buffer that stores pending commands */
static uint8_t                          producer_index;                                       /**< Index of the next available DCC command buffer slot that can be filled */
static uint8_t                          consumer_index;                                       /**< Index of the DCC command buffer slot currently being transmitted */
static bool                             phase1_complete;                                      /**< Flag to control phases of DCC command */
static bool                             phase2_complete;                                      /**< Flag to control phases of DCC command */
static bool                             dcc_output_state;                                     /**< Flag to track whether we are currently outputting a DCC 1 or 0 */
static bool                             dcc_disabled;                                         /**< Flag to indicate whether DCC has been disabled completely */
static bool                             adc_baseline_flag;                                    /**< Flag to indicate to the ADC it should store its result as a baseline */
static uint32_t                         adc_baseline;                                         /**< Baseline of current feedback measurement */
static bool                             feedback_window_end;                                  /**< Flag to indicate that the feedback window should end */
static bool                             feedback_in_progress;                                 /**< Flag to indicate whether we are monitoring for feedback */
static bool                             acknowledge;                                          /**< Flag to indicate an acknowledge was received during feedback */
static bool                             service_command_pending;                              /**< Flag to indicate whether a service command is pending */
static bool                             service_command_in_progress;                          /**< Flag to indicate whether a service command is in progress */
static uint8_t                          programming_track_mode;                               /**< Variable to keep track of programming track mode */
static uint8_t                          programming_track_state;                              /**< Variable to keep track of programming track state */
static uint8_t                          function;                                             /**< Function of the service command pending/in progress */
static uint8_t                          mode;                                                 /**< Mode of the service command pending/in progress */
static uint8_t                          CV_or_reg_upper;                                      /**< Upper portion of CV or register of the service command pending/in progress */
static uint8_t                          CV_or_reg_lower;                                      /**< Lower portion of CV or register of the service command pending/in progress */
static uint8_t                          value;                                                /**< Value to be written of the service command pending/in progress */
static uint16_t                         read_byte_counter;                                    /**< Read byte counter of the service command pending/in progress */
static uint8_t                          read_bit_counter;                                     /**< Read bit counter of the service command pending/in progress */
static uint8_t                          read_bit_value;                                       /**< Read bit response of the service command pending/in progress */
static dcc_command_t                    idle_packet;                                          /**< Memory reserved to transmit idle packets */
static uint32_t                         active_speed_command_index;                           /**< Current place in the speed command array */
static dcc_command_t                    speed_command_array_temp[SPEED_COMMAND_ARRAY_SIZE];   /**< Array for sending periodic speed commands */
static dcc_command_t                    speed_command_array[SPEED_COMMAND_ARRAY_SIZE];        /**< Array for storing periodic speed commands */
static uint8_t                          speed_command_address_type[SPEED_COMMAND_ARRAY_SIZE]; /**< Array for keeping track of the address type the corresponding periodic speed command applies to */
static uint16_t                         speed_command_address[SPEED_COMMAND_ARRAY_SIZE];      /**< Array for keeping track of the address the corresponding periodic speed command applies to */


/**@brief Function for removing all periodic speed commands
 */
static void remove_all_speed_commands (void)
{
    uint32_t i;
    for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
    {
        speed_command_array[i].occupied = false;
        speed_command_array_temp[i].occupied = false;
        speed_command_address_type[i] = ADDRESS_TYPE_INVALID;
    }
}


/**@brief Function for disabling the DCC output.
 *
 * @details This function is called whenever the DCC output needs to be halted immediately (for example, in error condition). 
 * DCC output disabling is only resettable by complete system reset. 
 */
static void disable_DCC (uint8_t error_code)
{
    uint32_t err_code;
    
    // Raise flag
    dcc_disabled = true;

    // Turn on brake
    nrf_gpio_pin_clear(BRAKE_PIN_NO);

