tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
        // Only update the periodic speed commands when we are in main track mode
        if (programming_track_mode == MAIN)
        {
            // First identify the address (if valid)
            if (p_scheduled_dcc_command->byte1 == 0)
            {
                address_type = ADDRESS_TYPE_BROADCAST;
                address = p_scheduled_dcc_command->byte1;
                command_byte = p_scheduled_dcc_command->byte2;
                data_byte = p_scheduled_dcc_command->byte3;
            }
            else if ((p_scheduled_dcc_command->byte1 >= 1) && (p_scheduled_dcc_command->byte1 <= 127))
            {
                address_type = ADDRESS_TYPE_SHORT_CONSIST;
                address = p_scheduled_dcc_command->byte1;
                command_byte = p_scheduled_dcc_command->byte2;
                data_byte = p_scheduled_dcc_command->byte3;
            }
            else if ((p_scheduled_dcc_command->byte1 >= 192) && (p_scheduled_dcc_command->byte1 <= 231))
            {
                address_type = ADDRESS_TYPE_LONG;
                address = ((p_scheduled_dcc_command->byte1 & 0x3F) << 8) | p_scheduled_dcc_command->byte2;
                command_byte = p_scheduled_dcc_command->byte3;
                data_byte = p_scheduled_dcc_command->byte4;
            }
            
            // Now check if we have a speed command
            if (address_type != ADDRESS_TYPE_INVALID)
            {
                if (((command_byte == 0x3F) && ((data_byte & 0x7E) == 0)) || (((command_byte & 0xC0) == 0x40) && ((command_byte & 0x0E) == 0)))
                {
                    // We have a 128 step speed command or a 28 step speed command which is a stop or emergency stop
                    if (address_type == ADDRESS_TYPE_BROADCAST)
                    {
                        // For a broadcast command, wipe the periodic speed commands
                        remove_all_speed_commands();
                    }
                    else
                    {
                        // We only neeed to wipe the command of the affected address
                        index = index_for_periodic_speed_command(address_type, address);
                        if (index != SPEED_COMMAND_ARRAY_SIZE)
                        {
                            // We are safe to wipe a vacant location, if that is what was returned
                            speed_command_array[index].occupied = false;
                            speed_command_array_temp[index].occupied = false;
                            speed_command_address_type[index] = ADDRESS_TYPE_INVALID;
                        }
                    }
                }
                else if (((command_byte == 0x3F) && ((data_byte & 0x7E) != 0)) || (((command_byte & 0xC0) == 0x40) && ((command_byte & 0x0E) != 0)))
                {
                    // We have a 128 step speed command or a 28 step speed command which is a speed command
                    // Note we do this for all address types, including broadcast; the logic here is if someone is silly enough to do a broadcast speed command, it should still be periodicallly repeated
                    index = index_for_periodic_speed_command(address_type, address);
                    if (index != SPEED_COMMAND_ARRAY_SIZE)
                    {
                        // We are safe to add/overwrite
                        speed_command_address_type[index] = address_type;
                        speed_command_address[index] = address;
                        speed_command_array[index].occupied = false;
                        speed_command_array_temp[index].occupied = false;
                        memcpy(&speed_command_array[index], &speed_command, sizeof(dcc_command_t));
                        memcpy(&speed_command_array_temp[index], &speed_command, sizeof(dcc_command_t));
                        speed_command_array[index].occupied = true;
                        speed_command_array_temp[index].occupied = true;
                    }
                    else
                    {
                        // There was not enough room in the array, raise an error
                        disable_DCC(ERROR_CODE_MAX_TRAIN_EXCEEDED);
                    }
                }
            }
        }
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
    }
}


/**@brief Function for handling a write to the DCC Command characteristic.
 *
 * @details This function places the DCC Command on the buffer, encoding it appropriately. It will silently drop the command if there is insufficient space in the buffer.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   byte1          byte1 of DCC command (MSB).
 * @param[in]   byte2          byte2 of DCC command.
 * @param[in]   byte3          byte3 of DCC command.
 * @param[in]   byte4          byte4 of DCC command.
 * @param[in]   byte5          byte5 of DCC command.
 * @param[in]   byte6          byte6 of DCC command.
 * @param[in]   len            Length of DCC command in bytes.
 * @param[in]   feedback       Flag to indicate whether a feedback window should be opened for this command (LSB).
 */
static void dcc_command_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4, uint8_t byte5, uint8_t len)
{
    scheduled_dcc_command_t scheduled_dcc_command;
    uint32_t err_code;
    UNUSED_VARIABLE(p_bluetrack);
    
    // Only schedule the enqueue of the command if we have no service command pending or in progress
    if (!service_command_pending && !service_command_in_progress)
    {
        scheduled_dcc_command.byte1 = byte1;
        scheduled_dcc_command.byte2 = byte2;
        scheduled_dcc_command.byte3 = byte3;
        scheduled_dcc_command.byte4 = byte4;
        scheduled_dcc_command.byte5 = byte5;
        scheduled_dcc_command.len = len;
        scheduled_dcc_command.feedback = 0;
        
        err_code = app_sched_event_put(&scheduled_dcc_command, sizeof(scheduled_dcc_command_t), enqueue_dcc_command_from_scheduler);
        APP_ERROR_CHECK(err_code);
    }
}


