tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
                // 1 reset packet
                enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
            }
        }
#ifdef DEBUG
        err_code = app_uart_put_string("Service command enqueued\n\r");
        APP_ERROR_CHECK(err_code);
#endif
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
    }
}


/**@brief Function for handling the GPIOTE interrupt.
 *
 * @details The GPIOTE interrupt handler will only be called on thermal pin going LOW, indicating overtemperature, therefore disable DCC.
 */
void GPIOTE_IRQHandler(void)
{
    // Clear event
    NRF_GPIOTE->EVENTS_IN[0] = 0;

    // Disable DCC
    disable_DCC(ERROR_CODE_OVERTEMPERATURE);
}


/**@brief Function for handling the LPCOMP interrupt.
 *
 * @details The LPCOMP interrupt handler will only be called on a READY or UP event from the comparator. In both these cases, check the result of the comparison.
 * For the READY case, this checks if the comparator is already HIGH on activation. For the UP case, this provides a "debounce" of sorts. If the result is HIGH, 
 * disable DCC, as we are in an overcurrent condition. 
 */
void LPCOMP_IRQHandler(void)
{
    // Clear events
    NRF_LPCOMP->EVENTS_READY = 0;
    NRF_LPCOMP->EVENTS_UP = 0;

    // We are either ready, or we observed a up crossing; obtain sample
    NRF_LPCOMP->TASKS_SAMPLE = 1;
    if (NRF_LPCOMP->RESULT)
    {
        // Disable DCC
        disable_DCC(ERROR_CODE_OVERCURRENT);
    }
}


/**@brief Function for handling the ADC interrupt.
 *
 * @details The ADC interrupt handler will only be called on an END event. In this case, the result is read. Depending on the state of the application flags, 
 * this result is either stored as the baseline of a feedback collection, or compared to the baseline to determine whether the acknowledge flag should be raised.
 */
void ADC_IRQHandler(void)
{
    // Clear event
    NRF_ADC->EVENTS_END = 0;

    // Record or compare to baseline
    if (adc_baseline_flag)
    {
        adc_baseline = NRF_ADC->RESULT;
        adc_baseline_flag = false;
    }
    else
    {
        // Set acknowledge if the result was the required amount above the baseline
        if (NRF_ADC->RESULT > (adc_baseline + ADC_DELTA))
        {
            acknowledge = true;
        }
    }
}


/**@brief Function for handling the TIMER1 interrupt.
 *
 * @details This interrupt drives the DCC output logic. Based on the phase flags, and the state of the buffer, appropriate values are loaded into TIMER1 CC[0]
 * register correponding to durations of DCC 1s and 0s. A sync output is triggered at the start of each packet. If required, feedback is collected.
 */
void TIMER1_IRQHandler(void)
{
    uint32_t err_code;
    dcc_command_t *active_packet = NULL;
    bool dcc_packet = false;
    uint32_t i;

    // Clear events
    NRF_TIMER1->EVENTS_COMPARE[0] = 0;

    if (phase1_complete)
    {
        // We have ended phase 1, timer value remains the same for phase 2
        phase1_complete = false;
        phase2_complete = true;
    }
    else if (phase2_complete)
    {
        // We have ended phase 2, timer value update may be required
        // First check if there is a pending packet (idle, repeat command, or from the buffer); a packet from the buffer takes priority
        if (dcc_command_buffer[consumer_index].occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == MAIN_REPEAT)))
        {
            active_packet = &dcc_command_buffer[consumer_index];
            dcc_packet = true;
        }
        else if (speed_command_array_temp[active_speed_command_index].occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == PROGRAMMING)))
        {
            active_packet = &speed_command_array_temp[active_speed_command_index];
        }
        else if (idle_packet.occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == MAIN_REPEAT)))
        {
            active_packet = &idle_packet;
        }
        
        if (active_packet)
        {
            // Clear the sync output
            nrf_gpio_pin_clear(SYNC_PIN_NO);
            // Enable sync output if this is the first bit of this packet
            if (active_packet->sync)
            {
                nrf_gpio_pin_set(SYNC_PIN_NO);
                active_packet->sync = false;
            }

            // Only start feedback if feedback is not in progress
            if (active_packet->feedback && !feedback_in_progress)
            {
                // Set variables
                feedback_in_progress = true;
                adc_baseline_flag = true;
                feedback_window_end = false;
                acknowledge = false;
                // Start ADC
                NRF_ADC->TASKS_START = 1;
                // Start timer
                err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL, APP_TIMER_PRESCALER), NULL);
                APP_ERROR_CHECK(err_code);
            }
            // Clear feedback flag, we do not want to check it again for this packet
            active_packet->feedback = false;

            // Determine data for transmission
            if (active_packet->data0_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data0;
                active_packet->data0 = (active_packet->data0 << 1);
                active_packet->data0_count = active_packet->data0_count - 1;
            }
            else if (active_packet->data1_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data1;
                active_packet->data1 = (active_packet->data1 << 1);
                active_packet->data1_count = active_packet->data1_count - 1;
            }
            else if (active_packet->data2_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data2;
                active_packet->data2 = (active_packet->data2 << 1);
                active_packet->data2_count = active_packet->data2_count - 1;
            }
            else
            {
                APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
            }
            // Send data
            phase1_complete = true;
            phase2_complete = false;
            NRF_TIMER1->CC[0] = dcc_output_state ? DCC_ONE_CC_VAL : DCC_ZERO_CC_VAL;

            // Check for exhaustion and unset occupied
            if (active_packet->data2_count == 0)
            {
                active_packet->occupied = false;
                
                if (dcc_packet)
                {
                    // If it was a DCC packet, update global variables
                    consumer_index = consumer_index + 1;
                    // Reset consumer index if we have overflowed
                    if (consumer_index == DCC_COMMAND_BUFFER_SIZE)
                    {
                        consumer_index = 0;
                    }
                    
