tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
                    // If we were in a service command and the buffer is empty, indicate to the feedback timer that the buffer is empty and the service command is complete.
                    // This ensures we continue to look for basic acknowledgement pulses through the decoder recovery time (S-9.2.3)
                    // NOTE: This ASSUMES all service commands include a feedback command at some point, as the feedback timer is the only thing that can turn service_command_in_progress off
                    // ASSUME idle packets and speed command packets never request feedback
                    if (!dcc_command_buffer[consumer_index].occupied && service_command_in_progress)
                    {
                        feedback_window_end = true;
                    }
                }
            }
        }
        else
        {
            // There is nothing to send in any of the packet sources
            // We're guaranteed to have an empty buffer, so execute a service command, if one is pending
            if (service_command_pending) {
                service_command_in_progress = true;
                service_command_pending = false;
                err_code = app_sched_event_put(NULL, 0, execute_service_command);
                APP_ERROR_CHECK(err_code);
#ifdef DEBUG
                err_code = app_uart_put_string("Execute service command\n\r");
                APP_ERROR_CHECK(err_code);
#endif
            }
            
            // There was no valid speed command packet at the current index (or we were inhibited from sending it), so update the temporary array for that index, increment (to avoid fixating on a single valid entry) and identify the next valid one

            // Copy the speed command back over, making sure to set occupied last (a process removing a speed command will set occupied false first)
            speed_command_array_temp[active_speed_command_index].data0 = speed_command_array[active_speed_command_index].data0;
            speed_command_array_temp[active_speed_command_index].data0_count = speed_command_array[active_speed_command_index].data0_count;
            speed_command_array_temp[active_speed_command_index].data1 = speed_command_array[active_speed_command_index].data1;
            speed_command_array_temp[active_speed_command_index].data1_count = speed_command_array[active_speed_command_index].data1_count;
            speed_command_array_temp[active_speed_command_index].data2 = speed_command_array[active_speed_command_index].data2;
            speed_command_array_temp[active_speed_command_index].data2_count = speed_command_array[active_speed_command_index].data2_count;
            
            speed_command_array_temp[active_speed_command_index].sync = speed_command_array[active_speed_command_index].sync;
            speed_command_array_temp[active_speed_command_index].feedback = speed_command_array[active_speed_command_index].feedback;
            speed_command_array_temp[active_speed_command_index].occupied = speed_command_array[active_speed_command_index].occupied;
            
            // Increment the active speed command index so we don't repeat the command over and over
            active_speed_command_index = active_speed_command_index + 1;
            // Reset active speed command index if we have overflowed
            if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
            {
                active_speed_command_index = 0;
            }
            
            // Now go through the array once to find the next valid packet
            for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
            {
                if (speed_command_array_temp[active_speed_command_index].occupied)
                {
                    // We've found a valid packet
                    break;
                }
                else
                {
                    active_speed_command_index = active_speed_command_index + 1;
                    // Reset active speed command index if we have overflowed
                    if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
                    {
                        active_speed_command_index = 0;
                    }
                }
            }
            
            // The idle packet needs refreshing (or we were inhibited from sending it)
            idle_packet.data0 = 0xFFFFF000 | (0xFF << 3);
            idle_packet.data0_count = 30;
            idle_packet.data1 = 0x00004000 | (0x00 << 24) | ((0xFF ^ 0x00) << 15);
            idle_packet.data1_count = 18;
            idle_packet.data2 = 0x80000000;
            idle_packet.data2_count = 1;
            
            idle_packet.sync = false;
            idle_packet.feedback = false;
            idle_packet.occupied = true;
            
            // Now update the programming state
            if ((programming_track_mode == MAIN) && (programming_track_state != MAIN))
            {
                // Disable OUT[2] and OUT[3] GPIOTE
                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                
                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                
                // Set DCC output to OUT[2] (controlled by TIMER1) and DCC programming output to OUT[3] (continuous 1s)
                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
                NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                
                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
                NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                
                // Enable OUT[2] and OUT[3] GPIOTE
                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
                
                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;

                programming_track_state = MAIN;
            }
            else if (programming_track_mode == PROGRAMMING)
            {
                if (programming_track_state == PROGRAMMING)
                {
                    // Disable OUT[2] and OUT[3] GPIOTE
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                    
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                    
                    // Set DCC output to OUT[2] (controlled by TIMER1) and DCC programming output to OUT[3] (continuous 1s)
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
                    NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                    
