tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
                    NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                    
                    // Enable OUT[2] and OUT[3] GPIOTE
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
                    
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;

                    programming_track_state = MAIN_REPEAT;
                }
                else
                {
                    // Disable OUT[2] and OUT[3] GPIOTE
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                    
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
                    
                    // Set DCC programming output to OUT[2] (controlled by TIMER1) and DCC output to OUT[3] (continuous 1s)
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
                    NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                    
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
                    NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
                    
                    // Enable OUT[2] and OUT[3] GPIOTE
                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
                    
                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;

                    programming_track_state = PROGRAMMING;
                }
            }

            // Send a single one, as we have no data to send this time
            dcc_output_state = true;
            phase1_complete = true;
            phase2_complete = false;
            NRF_TIMER1->CC[0] = DCC_ONE_CC_VAL;
        }
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
    }
}


/**@brief Function for handling the feedback application timer expiry.
 *
 * @details Feedback application timer runs continuously every feedback window until the DCC buffer is empty. Every time it completes, it triggers
 * another ADC sample, or terminates the feedback window and, if required, the service command.
 */
static void feedback_timer_timeout_handler(void *p_context)
{
    uint32_t err_code;

    UNUSED_VARIABLE(p_context);

    // Check the counter; if expired, feedback window has finished
    if (!feedback_window_end)
    {
        // Trigger ADC sample
        NRF_ADC->TASKS_START = 1;
        err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL, APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // Buffer is empty in service mode
        if (function == FUNCTION_WRITE_BYTE || function == FUNCTION_WRITE_BIT)
        {
            // We are done now, transmit back result
            err_code = ble_bluetrack_response_update(&m_bluetrack, acknowledge ? 0x01 : 0x00, value);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            service_command_in_progress = false;
        }
        else if (function == FUNCTION_READ_BYTE)
        {
            // Last condition is special case to avoid repeating the read byte values for an address mode read
            if (acknowledge || (read_byte_counter >= READ_BYTE_COUNTER_MAX) || (mode == MODE_ADDRESS && read_byte_counter >= READ_BIT_COUNTER_MAX_ADDRESS))
            {
                // We have either received a positive response, or we've exhausted all values, transmit back result
                err_code = ble_bluetrack_response_update(&m_bluetrack, acknowledge ? 0x01 : 0x00, read_byte_counter);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
                service_command_in_progress = false;
            }
            else
            {
                // No response received, continue to try new values
                read_byte_counter = read_byte_counter + 1;
                err_code = app_sched_event_put(NULL, 0, execute_service_command);
                APP_ERROR_CHECK(err_code);
            }
        }
        else if (function == FUNCTION_READ_BIT)
        {
            read_bit_value = read_bit_value | ((acknowledge ? 1 : 0) << read_bit_counter);
            if (read_bit_counter >= READ_BIT_COUNTER_MAX)
            {
                // We have finished asking for the value of all bit positions, transmit back result
                err_code = ble_bluetrack_response_update(&m_bluetrack, 0x01, read_bit_value);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
                service_command_in_progress = false;
            }
            else
            {
                // Ask for next bit position
                read_bit_counter = read_bit_counter + 1;
                err_code = app_sched_event_put(NULL, 0, execute_service_command);
                APP_ERROR_CHECK(err_code);
            }
        }
        
        // Lower feedback flag
        feedback_in_progress = false;
    }
}


/**@brief Function for handling the output application timer expiry.
 *
 * @details Output application timer runs continuously. Every time it completes, it checks if it needs to actuate a relay output by looking at the flags. It passes the value of
 * the relay output to itself so it can clear it on expiry. Flags are searched independent of raise order. Only one relay is ever actuated at a time to protect the power supply.
 */
static void output_timer_timeout_handler(void *p_context)
{
    uint32_t * index = (uint32_t*)p_context;
    uint32_t i, err_code;
    bool enqueued_output = false;

    // Turn off output if one was actuated
    if (index != NULL)
    {
        nrf_gpio_pin_clear(*index);
    }

