tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    // Look for an enqueued output and start timer if we find one
    for (i = 0; i < (N_OUTPUTS); i++)
    {
        if (output_flags[i])
        {
            enqueued_output = true;

            // Lower flag
            output_flags[i] = false;

            // Turn on output
            nrf_gpio_pin_set(output_index[i]);

            // Start timer.
            err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), &(output_index[i]));
            APP_ERROR_CHECK(err_code);

            // Only one relay is to be actuated at at time to protect the power supply.
            break;
        }
    }

    if (!enqueued_output)
    {
        // Start timer with no output actuation
        err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), NULL);
        APP_ERROR_CHECK(err_code);
    }
#ifdef DEBUG
    err_code = app_uart_put_string("Output timer fired\n\r");
    APP_ERROR_CHECK(err_code);
#endif
}


/**@brief Function for initializing the GIO module.
 */
static void gio_init(void)
{
    uint32_t i;

    // Initialise overload LED
    nrf_gpio_cfg_output(OVERLOAD_LED_PIN_NO);
    nrf_gpio_pin_clear(OVERLOAD_LED_PIN_NO);

    // Initialise programming LED
    nrf_gpio_cfg_output(PROGRAMMING_LED_PIN_NO);
    nrf_gpio_pin_clear(PROGRAMMING_LED_PIN_NO);

    // Initialise stop LED (we start off stopped)
    nrf_gpio_cfg_output(STOP_LED_PIN_NO);
    nrf_gpio_pin_set(STOP_LED_PIN_NO);

    // Initialise sync output
    nrf_gpio_cfg_output(SYNC_PIN_NO);
    nrf_gpio_pin_clear(SYNC_PIN_NO);

    // Initialise brake output (LOW is engaged, we start off engaged)
    nrf_gpio_cfg_output(BRAKE_PIN_NO);
    nrf_gpio_pin_clear(BRAKE_PIN_NO);

    // Initialise relay outputs
    for (i =0; i < (N_OUTPUTS); i++)
    {
        nrf_gpio_cfg_output(i+OUTPUT_OFFSET);
        nrf_gpio_pin_clear(i+OUTPUT_OFFSET);
    }
}


/**@brief Function for initialising the GPIOTE module.
 */
static void gpiote_init(void)
{
    // Initialise DCC output - under GPIOTE control
    nrf_gpio_cfg_output(DCC_COMMAND_PIN_NO);
    
    // Initialise programming DCC output - under GPIOTE control
    nrf_gpio_cfg_output(DCC_COMMAND_PROG_PIN_NO);

    // Initialise BLE LED - under GPIOTE control initially
    nrf_gpio_cfg_output(BLE_LED_PIN_NO);

    // Initialise thermal input - under GPIOTE control
    nrf_gpio_cfg_sense_input(THERMAL_PIN_NO, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_HIGH);

    // Thermal input on IN[0]
    NRF_GPIOTE->CONFIG[0] = (
                            (GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos) |
                            (THERMAL_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
                            (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos)
                            );

    // Advertising output on OUT[1]
    NRF_GPIOTE->CONFIG[1] = (
                            (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
                            (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
                            (BLE_LED_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
                            (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
                            );

    // DCC output on OUT[2] (initially)
    NRF_GPIOTE->CONFIG[2] = (
                            (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
                            (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
                            (DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
                            (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
                            );
    
    // DCC programming output on OUT[3] (initially)
    NRF_GPIOTE->CONFIG[3] = (
                             (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
                             (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
                             (DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
                             (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
                             );

    // Configure IN[0] interrupt
    NRF_GPIOTE->INTENSET = GPIOTE_INTENSET_IN0_Msk;
    NVIC_ClearPendingIRQ(GPIOTE_IRQn);
    NVIC_SetPriority(GPIOTE_IRQn, GPIOTE_IRQ_PRI);
    NVIC_EnableIRQ(GPIOTE_IRQn);

    // Check if IN[0] was already low, if so, disable DCC
    if (!nrf_gpio_pin_read(THERMAL_PIN_NO))
    {
        disable_DCC(ERROR_CODE_OVERTEMPERATURE);
    }
}


#ifdef DEBUG
/**@brief Function for handling app_uart event callback.
 */
static void uart_handler(app_uart_evt_t * p_app_uart_event)
{
    uint32_t err_code = NRF_SUCCESS;
    uint8_t rx_data;

    switch (p_app_uart_event->evt_type)
    {
        case APP_UART_DATA_READY:
            // App does not receive data over UART, but we need to service the FIFO
            while (err_code != NRF_ERROR_NOT_FOUND)
            {
                err_code = app_uart_get(&rx_data);
            }
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_CHECK(p_app_uart_event->data.error_code);
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_CHECK(p_app_uart_event->data.error_communication);
            break;
        
        case APP_UART_TX_EMPTY:
            // Nothing to do.
            break;
        
        case APP_UART_DATA:
            // Nothing to do, app does not receive data over UART.
            break;

        default:
            // Nothing to do.
            break;
    }
}
#endif


#ifdef DEBUG
/**@brief Function for initialising the UART module.
 */
static void uart_init(void)
{
    uint32_t err_code;
    app_uart_comm_params_t uart_comm_params;

    uart_comm_params.rx_pin_no = UART_RX;
    uart_comm_params.tx_pin_no = UART_TX;
    uart_comm_params.rts_pin_no = UART_RTS;
    uart_comm_params.cts_pin_no = UART_CTS;
    uart_comm_params.flow_control = APP_UART_FLOW_CONTROL_ENABLED;
    uart_comm_params.use_parity = false;
    uart_comm_params.baud_rate = UART_BAUDRATE_BAUDRATE_Baud38400;

    APP_UART_FIFO_INIT(&uart_comm_params, UART_FIFO_RX_SIZE, UART_FIFO_TX_SIZE, uart_handler, APP_IRQ_PRIORITY_LOW, err_code);
    APP_ERROR_CHECK(err_code);
}
#endif


/**@brief Function for initialising timers.
 *
 * @details Initializes the application timer, as well as TIMER1 and TIMER2.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialise TIMER1
    NRF_TIMER1->PRESCALER = TIMER1_PRESCALER_VAL;
    // Short timer completion to clear
    NRF_TIMER1->SHORTS = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
    // Set initial timeout corresponding to a DCC one
    NRF_TIMER1->CC[0] = DCC_ONE_CC_VAL;
    NRF_TIMER1->INTENSET = TIMER_INTENSET_COMPARE0_Msk;
    // Register TIMER1 interrupt with softdevice
    NVIC_SetPriority(TIMER1_IRQn, TIMER1_IRQ_PRI);
    NVIC_ClearPendingIRQ(TIMER1_IRQn);
    NVIC_EnableIRQ(TIMER1_IRQn);

    // Initialise TIMER2 to LED flash timing
    NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_LED;
    // Short timer completion to clear
    NRF_TIMER2->SHORTS = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
    NRF_TIMER2->CC[0] = TIMER2_CC_VAL_LED;

    // Initialise application timer, with the scheduler.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);
    // Create output application timer
    err_code = app_timer_create(&output_timer, APP_TIMER_MODE_SINGLE_SHOT, output_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
    // Create feedback application timer
    err_code = app_timer_create(&feedback_timer, APP_TIMER_MODE_SINGLE_SHOT, feedback_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initialising the Programmable Peripheral Interconnect (PPI) module.
 *
 * @details Channels 0, 1, and 2 are used for the BLE LED, DCC Output, and DCC Programming Output respectively. These channels are not used by the softdevice.
 * As the softdevice controls access to the PPI, this configuration is done through softdevice calls. 
 */
static void ppi_init(void)
{
    uint32_t err_code;

