tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    // Configure PPI channel 0 to toggle GPIOTE OUT[1] (BLE LED) on every TIMER2 COMPARE[0] match
    err_code = sd_ppi_channel_assign(0, &NRF_TIMER2->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[1]);
    APP_ERROR_CHECK(err_code);

    // Enable PPI channel 0
    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH0_Enabled << PPI_CHEN_CH0_Pos);
    APP_ERROR_CHECK(err_code);

    // Configure PPI channel 1 to toggle GPIOTE OUT[2] (DCC Output) on every TIMER1 COMPARE[0] match
    err_code = sd_ppi_channel_assign(1, &NRF_TIMER1->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[2]);
    APP_ERROR_CHECK(err_code);

    // Enable PPI channel 1
    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH1_Enabled << PPI_CHEN_CH1_Pos);
    APP_ERROR_CHECK(err_code);
    
    // Configure PPI channel 2 to toggle GPIOTE OUT[3] (DCC Programming Output) on every TIMER2 COMPARE[0] match
    err_code = sd_ppi_channel_assign(2, &NRF_TIMER2->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[3]);
    APP_ERROR_CHECK(err_code);
    
    // Enable PPI channel 2
    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH2_Enabled << PPI_CHEN_CH2_Pos);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the LPCOMP module.
 */
static void lpcomp_init(void)
{
    // Select P0.1 as the LPCOMP input (LPCOMP can be used concurrently with the ADC provided the input is the same, as only the PSEL MUX is shared, see https://devzone.nordicsemi.com/question/22244/can-i-really-not-use-lpcomp-and-adc-at-the-same-time/)
    NRF_LPCOMP->PSEL = LPCOMP_PSEL_PSEL_AnalogInput2;
    // Set reference to VDD * 7/8
    // For sense R = 1.74k, the trip points are:

    // +---------------+------------+------------+
    // | Sensitivity   | VDD = 2.3V | VDD = 3.0V |
    // +---------------+------------+------------+
    // | 300uA/A (min) |    3.86A   |    5.03A   |
    // +---------------+------------+------------+
    // | 377uA/A (nom) |    3.07A   |    4.00A   |
    // +---------------+------------+------------+
    // | 450uA/A (max) |    2.57A   |    3.35A   |
    // +---------------+------------+------------+
    
    NRF_LPCOMP->REFSEL = LPCOMP_REFSEL_REFSEL_SupplySevenEighthsPrescaling;
    // Allow READY and UP event to trigger an interrupt
    NRF_LPCOMP->INTENSET = (LPCOMP_INTENSET_UP_Msk | LPCOMP_INTENSET_READY_Msk);
    // Finally, turn on the comparator
    NRF_LPCOMP->ENABLE = LPCOMP_ENABLE_ENABLE_Enabled;

    // Register LPCOMP interrupt with softdevice
    NVIC_SetPriority(LPCOMP_IRQn, LPCOMP_IRQ_PRI);
    NVIC_ClearPendingIRQ(LPCOMP_IRQn);
    NVIC_EnableIRQ(LPCOMP_IRQn);

    // Start up the comparator
    NRF_LPCOMP->TASKS_START = 1;
}


/**@brief Function for initializing the ADC module.
*/
static void adc_init(void)
{
    // Select P0.1 as the ADC input (ADC can be used concurrently with the LPCOMP provided the input is the same), 1.2V bandgap as reference, no prescaling, and 10 bit resolution
    NRF_ADC->CONFIG = (
                       (ADC_CONFIG_EXTREFSEL_None << ADC_CONFIG_EXTREFSEL_Pos) |
                       (ADC_CONFIG_PSEL_AnalogInput2 << ADC_CONFIG_PSEL_Pos) |
                       (ADC_CONFIG_REFSEL_VBG << ADC_CONFIG_REFSEL_Pos) |
                       (ADC_CONFIG_INPSEL_AnalogInputNoPrescaling << ADC_CONFIG_INPSEL_Pos) |
                       (ADC_CONFIG_RES_10bit << ADC_CONFIG_RES_Pos)
                      );
    // Allow END event to trigger an interrupt
    NRF_ADC->INTENSET = ADC_INTENSET_END_Msk;
    // Finally, turn on the ADC
    NRF_ADC->ENABLE = ADC_ENABLE_ENABLE_Enabled;

    // Register ADC interrupt with softdevice
    NVIC_SetPriority(ADC_IRQn, ADC_IRQ_PRI);
    NVIC_ClearPendingIRQ(ADC_IRQn);
    NVIC_EnableIRQ(ADC_IRQn);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for initializing BlueTrack data structures.
 */
static void bluetrack_init(void)
{
    uint32_t i;

    // Populate index array and initialise flags
    for(i = 0; i < (N_OUTPUTS); i++)
    {
        output_index[i] = i + OUTPUT_OFFSET;
        output_flags[i] = false;
    }

    // Clear buffer
    memset(dcc_command_buffer, 0, sizeof(dcc_command_buffer));
    
    // Clear idle memory
    memset(&idle_packet, 0, sizeof(idle_packet));

    // Set indexes and phases
    producer_index = 0;
    consumer_index = 0;
    phase1_complete = true;
    phase2_complete = false;

    // We start with no pending speed commands
    remove_all_speed_commands();
    active_speed_command_index = 0;
    
    // Send ones at the start
    dcc_output_state = true;

    // We start off with DCC enabled
    dcc_disabled = false;

    // We start of with feedback not in progress
    feedback_in_progress = false;

    // We start off with the main track selected
    programming_track_mode = MAIN;
    programming_track_state = MAIN;
    
    // We start off with no service command pending
    service_command_pending = false;
    
    // We start off with no service command in progress
    service_command_in_progress = false;
    
    // We do not send 20 reset packets and 10 idle packets, as suggested by S-9.2.4
}


/**@brief Function for starting timers.
*/
static void timers_start(void)
{
    uint32_t err_code;

    // Start relay timer
    err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), NULL);
    APP_ERROR_CHECK(err_code);

    // Start DCC output timer
    NRF_TIMER1->TASKS_START = 1;
    
    // Start LED and programming DCC output timer
    NRF_TIMER2->TASKS_START = 1;
}


/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
#ifdef DEBUG
    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    ble_debug_assert_handler(error_code, line_num, p_file_name);
#else
    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
#endif
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


