tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t             err_code;
    ble_gap_adv_params_t adv_params;

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = sd_ble_gap_adv_start(&adv_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t                         err_code;
    static ble_gap_evt_auth_status_t m_auth_status;
    ble_gap_enc_info_t *             p_enc_info;
    uint16_t                         m_programming_track_select_len = PROGRAMMING_TRACK_SELECT_CHAR_SIZE;
    uint8_t                          m_programming_track_select_value = 0x00;
    uint16_t                         m_stop_len = STOP_CHAR_SIZE;
    uint8_t                          m_stop_value = 0x01;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            // Remove LED from GPIOTE control
            NRF_GPIOTE->CONFIG[1] &= ~GPIOTE_CONFIG_MODE_Msk;
            NRF_GPIOTE->CONFIG[1] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
            
            // Reconfigure TIMER2 for DCC output
            NRF_TIMER2->TASKS_STOP = 1;
            NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_DCC;
            NRF_TIMER2->CC[0] = DCC_ONE_CC_VAL;
            NRF_TIMER2->TASKS_START = 1;
            
            // Set LED
            nrf_gpio_pin_set(BLE_LED_PIN_NO);

            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

            break;

        case BLE_GAP_EVT_DISCONNECTED:
            // Reconfigure TIMER2 for LED output
            NRF_TIMER2->TASKS_STOP = 1;
            NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_LED;
            NRF_TIMER2->CC[0] = TIMER2_CC_VAL_LED;
            NRF_TIMER2->TASKS_START = 1;
            
            // Restore LED to GPIOTE control
            NRF_GPIOTE->CONFIG[1] &= ~GPIOTE_CONFIG_MODE_Msk;
            NRF_GPIOTE->CONFIG[1] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
            
            m_conn_handle = BLE_CONN_HANDLE_INVALID;

            // Remove all pending periodic speed commands
            remove_all_speed_commands();
            
            // Reset programming track selection and characteristic
            programming_track_mode = MAIN;
            err_code = sd_ble_gatts_value_set(m_bluetrack.programming_track_select_char_handles.value_handle, 0, &m_programming_track_select_len, &m_programming_track_select_value);
            APP_ERROR_CHECK(err_code);

            // Reset stop selection and characteristic
            nrf_gpio_pin_clear(BRAKE_PIN_NO);
            nrf_gpio_pin_set(STOP_LED_PIN_NO);
            err_code = sd_ble_gatts_value_set(m_bluetrack.stop_char_handles.value_handle, 0, &m_stop_len, &m_stop_value);
            APP_ERROR_CHECK(err_code);

            // Restart advertising
            advertising_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_SUCCESS,
                                                   &m_sec_params);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_AUTH_STATUS:
            m_auth_status = p_ble_evt->evt.gap_evt.params.auth_status;
            break;

        case BLE_GAP_EVT_SEC_INFO_REQUEST:
            p_enc_info = &m_auth_status.periph_keys.enc_info;
            if (p_enc_info->div == p_ble_evt->evt.gap_evt.params.sec_info_request.div)
            {
                err_code = sd_ble_gap_sec_info_reply(m_conn_handle, p_enc_info, NULL);
                APP_ERROR_CHECK(err_code);
            }
            else
            {
                // No keys found for this device
                err_code = sd_ble_gap_sec_info_reply(m_conn_handle, NULL, NULL);
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
            {
                // Simply commence advertising again
                advertising_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_bluetrack_on_ble_evt(&m_bluetrack, p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;
    ble_opt_t cpu_blocking_enabled;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, true);

